In [26]:
import pandas as pd

# 1) Caricamento del dataset del Titanic da un file CSV
df = pd.read_csv('titanic.csv')

In [27]:
# 2) Calcolo del numero totale di passeggeri nel dataset
numero_passeggeri = len(df)
numero_passeggeri

891

In [5]:
# 3) Calcolo della tariffa media per classe
tariffa_media_per_classe = df.groupby('Pclass')['Fare'].mean()
print("\nTariffa media per classe:")
tariffa_media_per_classe

Tariffa media per classe:

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [6]:
# 4) Mostra le prime 5 righe del dataset
print("\nPrime 5 righe del dataset:")
df.head()

Prime 5 righe del dataset:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
# 5) Conteggio dei passeggeri per ciascun sesso
conteggio_per_sesso = df['Sex'].value_counts()
print("\nConteggio dei passeggeri per sesso:")
conteggio_per_sesso

Conteggio dei passeggeri per sesso:

Sex
male      577
female    314
Name: count, dtype: int64

In [8]:
# 6) Mostra la colonna dei sopravvissuti
print("\nColonna dei sopravvissuti:")
df['Survived']

Colonna dei sopravvissuti:

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [9]:
# 7) Conta il numero di sopravvissuti e non sopravvissuti
conteggio = df['Survived'].value_counts()
print("\nConteggio di sopravvissuti e non sopravvissuti:")
conteggio

Conteggio di sopravvissuti e non sopravvissuti:

Survived
0    549
1    342
Name: count, dtype: int64

In [10]:
# 8) Visualizza i nomi dei sopravvissuti
nomi_sopravvissuti = df[df['Survived'] == 1]['Name']
print("\nNomi dei sopravvissuti:")
nomi_sopravvissuti

Nomi dei sopravvissuti:

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
8      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                    Nasser, Mrs. Nicholas (Adele Achem)
                             ...
875                     Najib, Miss. Adele Kiamie "Jane"
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
887                         Graham, Miss. Margaret Edith
889                                Behr, Mr. Karl Howell
Name: Name, Length: 342, dtype: object

In [11]:
# 9) Calcola statistiche descrittive per le colonne numeriche del dataset
statistiche_descrittive = df.describe()
print("\nStatistiche descrittive per colonne numeriche:")
statistiche_descrittive

Statistiche descrittive per colonne numeriche:

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [50]:
# 10) Sopravvivenza per genere: Calcola la percentuale di sopravvivenza per ciascun genere
percentuale_sopravvivenza_per_genere = df.groupby('Sex')['Survived'].mean() * 100
print("\nPercentuale di sopravvivenza per genere:")
percentuale_sopravvivenza_per_genere

Percentuale di sopravvivenza per genere:

Sex
female    74.203822
male      18.890815
Name: Survived, dtype: float64

In [13]:
# 11) Calcolo dell'età media per genere
eta_media_per_genere = df.groupby('Sex')['Age'].mean()
print("\nEtà media per genere:")
eta_media_per_genere

Età media per genere:

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [14]:
# 12) Calcola la percentuale di sopravvivenza per fasce di età
# Considerando fasce di età come <18, 18-60, >60
df.loc[df['Age'] < 18, 'AgeGroup'] = '<18'
df.loc[(df['Age'] >= 18) & (df['Age'] <= 60), 'AgeGroup'] = '18-60'
df.loc[df['Age'] > 60, 'AgeGroup'] = '>60'
percentuale_sopravvivenza_per_fascia_eta = df.groupby('AgeGroup')['Survived'].mean() * 100
print("\nPercentuale di sopravvivenza per fasce di età:")
percentuale_sopravvivenza_per_fascia_eta

Percentuale di sopravvivenza per fasce di età:

AgeGroup
18-60    38.687392
<18      53.982301
>60      22.727273
nan      29.378531
Name: Survived, dtype: float64

In [15]:
# 13) Contare quante persone viaggiavano in ciascuna classe (1a, 2a, 3a)
conteggio_per_classe = df['Pclass'].value_counts()
print("\nConteggio di passeggeri per classe:")
conteggio_per_classe

Conteggio di passeggeri per classe:

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [16]:
# 14) Contare quanti biglietti sono stati venduti per ogni classe
biglietti_per_classe = df.groupby('Pclass')['Ticket'].count()
print("\nConteggio di biglietti venduti per classe:")
biglietti_per_classe

Conteggio di biglietti venduti per classe:

Pclass
1    216
2    184
3    491
Name: Ticket, dtype: int64

In [17]:
# 15) Quanti sono i sopravvissuti per ogni classe?
sopravvissuti_per_classe = df.groupby('Pclass')['Survived'].sum()
print("\nNumero di sopravvissuti per classe:")
sopravvissuti_per_classe

Numero di sopravvissuti per classe:

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [18]:
# 16) Sopravvivenza per classe e genere
sopravvivenza_per_classe_genere = df.groupby(['Pclass', 'Sex'])['Survived'].mean() * 100
print("\nPercentuale di sopravvivenza per classe e genere:")
sopravvivenza_per_classe_genere

Percentuale di sopravvivenza per classe e genere:

Pclass  Sex
1       female    96.808511
        male      36.885246
2       female    92.105263
        male      15.740741
3       female    50.000000
        male      13.544669
Name: Survived, dtype: float64

In [19]:
# 17) Mostra i primi 5 passeggeri con il prezzo del biglietto più alto
top_5_prezzo_biglietto_alto = df.nlargest(5, 'Fare')
print("\nPrimi 5 passeggeri con il prezzo del biglietto più alto:")
top_5_prezzo_biglietto_alto

Primi 5 passeggeri con il prezzo del biglietto più alto:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,AgeGroup
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C,18-60
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C,18-60
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,18-60
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S,18-60
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S,18-60

In [20]:
# 18) Calcola l'età media dei sopravvissuti e dei non sopravvissuti
eta_media_sopravvissuti = df[df['Survived'] == 1]['Age'].mean()
eta_media_non_sopravvissuti = df[df['Survived'] == 0]['Age'].mean()
print(f"\nEtà media dei sopravvissuti: {eta_media_sopravvissuti}")
print(f"Età media dei non sopravvissuti: {eta_media_non_sopravvissuti}")

Età media dei sopravvissuti: 28.343689655172415
Età media dei non sopravvissuti: 30.62617924528302

In [21]:
# 19) Distribuzione dei passeggeri per porto di imbarco
distribuzione_porto_imbarco = df['Embarked'].value_counts()
print("\nDistribuzione dei passeggeri per porto di imbarco:")
distribuzione_porto_imbarco

Distribuzione dei passeggeri per porto di imbarco:

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [22]:
# 20) Gestione dei valori mancanti per l'età: Sostituire i valori mancanti con la mediana dell'età
mediana_eta = df['Age'].median()
mediana_eta

28.0

In [23]:
df['Age'].fillna(mediana_eta, inplace=True)

# Visualizzazione delle prime 5 righe aggiornate del dataset
print("\nPrime 5 righe aggiornate del dataset:")
print(df.head())

Prime 5 righe aggiornate del dataset:
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked AgeGroup
0      0         A/5 21171   7.2500   NaN        S    18-60
1      0          PC 17599  71.2833   C85        C    18-60
2      0  STON/O2. 3101282   7.9250   NaN        S    18-60
3      0            113803  53.1000  C123        S    18-60
4      0            373450   8.0500   NaN        S    18-60

In [24]:
df['Age'].head(30)

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5     28.0
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
15    55.0
16     2.0
17    28.0
18    31.0
19    28.0
20    35.0
21    34.0
22    15.0
23    28.0
24     8.0
25    38.0
26    28.0
27    19.0
28    28.0
29    28.0
Name: Age, dtype: float64